app/Controllers/Admin/SpayOrangTuaController.php

SELECT *
FROM `spay_orang_tua`
ORDER BY `created_at` DESC
---
    public function index()
    {
        $data['orang_tua'] = $this->model->orderBy('created_at', 'DESC')->findAll();