app/Controllers/Admin/SpayTagihanController.php

SELECT *
FROM `spay_orang_tua`
WHERE `is_active` = 1
ORDER BY `nama` ASC
SELECT DISTINCT `kategori`
FROM `spay_tagihan`
WHERE `kategori` IS NOT NULL
AND `kategori` != ''
---
    public function tambah()
    {
        $data['orang_tua_list'] = $this->orangTuaModel
            ->where('is_active', 1)
            ->orderBy('nama', 'ASC')
            ->findAll();

        // Get existing categories for dropdown
        $db = \Config\Database::connect();
        $data['kategori_list'] = $db->table('spay_tagihan')
            ->select('kategori')->distinct()
            ->where('kategori IS NOT NULL')
            ->where('kategori !=', '')
            ->get()->getResultArray();