app/Controllers/Admin/SpayTagihanController.php

    public function index()
    {
        $searchSiswa = $this->request->getGet('search_siswa');
        $searchKelas = $this->request->getGet('search_kelas');

        $db = \Config\Database::connect();

        $builder = $db->table('spay_tagihan st')
            ->select('st.*, ot.nama as nama_ortu, ot.email, ot.nama_siswa, ot.kelas')
            ->join('spay_orang_tua ot', 'ot.id = st.orang_tua_id', 'left');

        if (!empty($searchSiswa)) {
            $builder->like('ot.nama_siswa', $searchSiswa);
        }

        if (!empty($searchKelas)) {
            $builder->where('ot.kelas', $searchKelas);
        }

        $data['tagihan'] = $builder->orderBy('st.created_at', 'DESC')
            ->get()->getResultArray();

        $data['search_siswa'] = $searchSiswa;
        $data['search_kelas'] = $searchKelas;

        // Get unique classes for filter dropdown
        $data['kelas_list'] = $db->table('spay_orang_tua')
            ->select('kelas')->distinct()
            ->where('kelas IS NOT NULL')
            ->where('kelas !=', '')
            ->where('is_active', 1)
            ->orderBy('kelas', 'ASC')
            ->get()->getResultArray();
---
SELECT `st`.*, `ot`.`nama` as `nama_ortu`, `ot`.`email`, `ot`.`nama_siswa`, `ot`.`kelas`
FROM `spay_tagihan` `st`
LEFT JOIN `spay_orang_tua` `ot` ON `ot`.`id` = `st`.`orang_tua_id`
ORDER BY `st`.`created_at` DESC
SELECT DISTINCT `kelas`
FROM `spay_orang_tua`
WHERE `kelas` IS NOT NULL
AND `kelas` != ''
AND `is_active` = 1
ORDER BY `kelas` ASC

    public function tambah()
    {
        $data['orang_tua_list'] = $this->orangTuaModel
            ->where('is_active', 1)
            ->orderBy('nama', 'ASC')
            ->findAll();

        $db = \Config\Database::connect();

        // Get unique classes from active parents
        $data['kelas_list'] = $db->table('spay_orang_tua')
            ->select('kelas')->distinct()
            ->where('kelas IS NOT NULL')
            ->where('kelas !=', '')
            ->where('is_active', 1)
            ->orderBy('kelas', 'ASC')
            ->get()->getResultArray();

        // Get existing categories for dropdown
        $data['kategori_list'] = $db->table('spay_tagihan')
            ->select('kategori')->distinct()
            ->where('kategori IS NOT NULL')
            ->where('kategori !=', '')
            ->get()->getResultArray();
---
SELECT *
FROM `spay_orang_tua`
WHERE `is_active` = 1
ORDER BY `nama` ASC
SELECT DISTINCT `kelas`
FROM `spay_orang_tua`
WHERE `kelas` IS NOT NULL
AND `kelas` != ''
AND `is_active` = 1
ORDER BY `kelas` ASC
SELECT DISTINCT `kategori`
FROM `spay_tagihan`
WHERE `kategori` IS NOT NULL
AND `kategori` != ''