app/Controllers/OrangTua/PembayaranController.php

SELECT *
FROM `spay_orang_tua`
WHERE `spay_orang_tua`.`id` = '5'
---
    public function dashboard()
    {
        $id = session()->get('orangtua_id');
        $orangTuaModel = new \App\Models\SpayOrangTuaModel();
        $data['orangtua'] = $orangTuaModel->find($id);