app/Controllers/Admin.php

    public function pendaftaran()
    {
        $pendaftaranModel = new \App\Models\PendaftaranModel();
        $data = [
            'title'       => 'Data Pendaftaran - Admin RA Perwanida',
            'pendaftaran' => $pendaftaranModel->orderBy('created_at', 'DESC')->findAll()
---
SELECT *
FROM `pendaftaran`
ORDER BY `created_at` DESC

    private function getPengumumanAktif(string $today): array
    {
        if (! $this->tableExists('pengumuman')) {
            return [];
        }

        return Database::connect()
            ->table('pengumuman')
            ->where('status', 'aktif')
            ->where('tanggal_mulai <=', $today)
            ->where('tanggal_selesai >=', $today)
            ->orderBy('prioritas', 'DESC')
            ->get()
            ->getResultArray();
---
SELECT *
FROM `pengumuman`
WHERE `status` = 'aktif'
AND `tanggal_mulai` <= '2026-05-23'
AND `tanggal_selesai` >= '2026-05-23'
ORDER BY `prioritas` DESC