app/Controllers/Developer.php

    public function index()
    {
        $db = Database::connect();

        // System Information
        $dbVersion = $db->getVersion();
        $dbPlatform = $db->getPlatform();
        $phpVersion = PHP_VERSION;

        // Writable directories size
        $cacheSize = $this->getDirectorySize(WRITEPATH . 'cache');
        $logsSize = $this->getDirectorySize(WRITEPATH . 'logs');
        $debugSize = $this->getDirectorySize(WRITEPATH . 'debugbar');

        // Database tables list and row count
        $tables = [];
        if ($db->connID) {
            $tablesRaw = $db->listTables();
            foreach ($tablesRaw as $table) {
                $count = $db->table($table)->countAllResults();
                $tables[] = [
                    'name' => $table,
                    'rows' => $count
                ];
            }
        }

        // Activity logs
        $logs = [];
        if ($db->tableExists('log_aktivitas')) {
            $logs = $db->table('log_aktivitas')
                ->select('log_aktivitas.*, users.username')
                ->join('users', 'users.id_users = log_aktivitas.id_user', 'left')
                ->orderBy('log_aktivitas.created_at', 'DESC')
                ->limit(20)
                ->get()
                ->getResultArray();
---
SELECT `log_aktivitas`.*, `users`.`username`
FROM `log_aktivitas`
LEFT JOIN `users` ON `users`.`id_users` = `log_aktivitas`.`id_user`
ORDER BY `log_aktivitas`.`created_at` DESC
 LIMIT 20