app/Controllers/Guru.php

    public function index()
    {
        $data['guru'] = $this->guru->findAll();
---
SELECT *
FROM `guru`