app/Controllers/Home.php

    public function index() {
        $guru  = new GuruModel();
        $murid = new MuridModel();
        $bannerModel = new \App\Models\BannerModel();
        $beritaModel = new \App\Models\BeritaModel();

        $data = [
            'total_guru'    => $guru->findAll(),
            'total_murid'   => $murid->findAll(), // Ubah $siswa menjadi $murid
            'banners'       => $bannerModel->where('is_active', 1)->orderBy('id', 'DESC')->findAll(),
            'latest_berita' => $beritaModel->orderBy('tanggal', 'DESC')->orderBy('id', 'DESC')->findAll(3),
---
SELECT *
FROM `banners`
WHERE `is_active` = 1
ORDER BY `id` DESC
SELECT *
FROM `berita`
ORDER BY `tanggal` DESC, `id` DESC
 LIMIT 3