app/Controllers/Home.php

SELECT *
FROM `guru`
SELECT *
FROM `murid`
---
    public function index() {
        $guru  = new GuruModel();
        $murid = new MuridModel();

        $data = [
            'total_guru'  => $guru->findAll(),
            'total_murid' => $murid->findAll(), // Ubah $siswa menjadi $murid
            'title'       => 'Beranda - Dashboard Publik'
        ];