app/Controllers/Jadwal.php

    public function index()
    {
        $id_kelas = $this->request->getGet('kelas');

        if (strtolower((string) session('role')) === 'guru') {
            $assignedKelas = $this->kelasModel->where('id_guru', session('id_guru'))->first();
            $myKelasId = $assignedKelas ? (int) $assignedKelas['id_kelas'] : 0;
            $id_kelas = $myKelasId;
            $kelasList = $this->kelasModel->where('id_kelas', $myKelasId)->findAll();
        } else {
            $kelasList = $this->kelasModel->findAll();
---
SELECT *
FROM `kelas`