app/Controllers/Kehadiran.php

SELECT `kelas`.*, `guru`.`nama_guru`
FROM `kelas`
LEFT JOIN `guru` ON `guru`.`id` = `kelas`.`id_guru`
ORDER BY `kelas`.`nama_kelas` ASC
---
    private function getKelasList(): array
    {
        return $this->kelasModel
            ->select('kelas.*, guru.nama_guru')
            ->join('guru', 'guru.id = kelas.id_guru', 'left')
            ->orderBy('kelas.nama_kelas', 'ASC')
            ->findAll();