app/Controllers/Kehadiran.php

SELECT `kelas`.*, `guru`.`nama_guru`
FROM `kelas`
LEFT JOIN `guru` ON `guru`.`id` = `kelas`.`id_guru`
ORDER BY `kelas`.`nama_kelas` ASC
---
    private function getKelasList(): array
    {
        $builder = $this->kelasModel
            ->select('kelas.*, guru.nama_guru')
            ->join('guru', 'guru.id = kelas.id_guru', 'left');

        if (strtolower((string) session('role')) === 'guru') {
            $builder->where('kelas.id_guru', session('id_guru'));
        }

        return $builder->orderBy('kelas.nama_kelas', 'ASC')
            ->findAll();