app/Controllers/Kelas.php

    public function index()
    {
        $data['kelas'] = $this->kelas
            ->select('kelas.*, guru.nama_guru, pendidikan.nama')
            ->join('guru', 'guru.id = kelas.id_guru', 'left')
            ->join('pendidikan', 'pendidikan.id_pendidikan = kelas.id_pendidikan', 'left')
            ->findAll();
---
SELECT `kelas`.*, `guru`.`nama_guru`, `pendidikan`.`nama`
FROM `kelas`
LEFT JOIN `guru` ON `guru`.`id` = `kelas`.`id_guru`
LEFT JOIN `pendidikan` ON `pendidikan`.`id_pendidikan` = `kelas`.`id_pendidikan`

    public function edit($id)
    {
        $data['kelas'] = $this->kelas->find($id);

        $data['guru'] = $this->guru->findAll();
        $data['pendidikan'] = $this->pendidikan->findAll();
---
SELECT *
FROM `guru`
SELECT *
FROM `pendidikan`