app/Controllers/Murid.php

    public function index()
    {
        $data['murid'] = $this->murid
            ->select('murid.*, kelas.nama_kelas')
            ->join('kelas', 'kelas.id_kelas = murid.id_kelas')
            ->findAll();
---
SELECT `murid`.*, `kelas`.`nama_kelas`
FROM `murid`
JOIN `kelas` ON `kelas`.`id_kelas` = `murid`.`id_kelas`

    public function edit($id_murid)
    {
        $data['murid'] = $this->murid->find($id_murid);
        $data['kelas'] = $this->kelas->findAll();
---
SELECT *
FROM `murid`
WHERE `murid`.`id` = '8'
SELECT *
FROM `kelas`