app/Controllers/OrangTua.php

public function index()
{
    $id_kelas = $this->request->getGet('kelas');
    $search = $this->request->getGet('search');

    $query = $this->orangTuaModel
        ->select('orang_tua.*, murid.nama_murid, kelas.nama_kelas')
        ->join('murid','murid.id=orang_tua.id_murid')
        ->join('kelas','kelas.id_kelas=murid.id_kelas');

    // filter kelas
    if (!empty($id_kelas)) {

        $query->where('murid.id_kelas', $id_kelas);

    }

    // pencarian
    if (!empty($search)) {

        $query->groupStart()
              ->like('murid.nama_murid', $search)
              ->orLike('orang_tua.nama_ayah', $search)
              ->orLike('orang_tua.nama_ibu', $search)
              ->groupEnd();

    }

    $data = [
        'orang_tua' => $query->findAll(),
        'kelas' => $this->kelasModel->findAll(),
        'id_kelas' => $id_kelas,
        'search' => $search
    ];
---
SELECT `orang_tua`.*, `murid`.`nama_murid`, `kelas`.`nama_kelas`
FROM `orang_tua`
JOIN `murid` ON `murid`.`id`=`orang_tua`.`id_murid`
JOIN `kelas` ON `kelas`.`id_kelas`=`murid`.`id_kelas`
SELECT *
FROM `kelas`