app/Controllers/Pengumuman.php

    public function index()
    {
        $data = [
            'pengumuman' => $this->pengumumanModel->orderBy('created_at', 'DESC')->findAll()
        ];
---
SELECT *
FROM `pengumuman`
ORDER BY `created_at` DESC