app/Controllers/Users.php

    public function index()
    {
        $db = Database::connect();

        $users = $this->userModel
            ->select('users.*, role.nama_role, guru.nama_guru')
            ->join('role', 'role.id_role = users.id_role', 'left')
            ->join('guru', 'guru.id = users.id_guru', 'left')
            ->orderBy('users.created_at', 'DESC')
            ->findAll();
---
SELECT `users`.*, `role`.`nama_role`, `guru`.`nama_guru`
FROM `users`
LEFT JOIN `role` ON `role`.`id_role` = `users`.`id_role`
LEFT JOIN `guru` ON `guru`.`id` = `users`.`id_guru`
ORDER BY `users`.`created_at` DESC