app/Models/LiburSekolahModel.php

SELECT *
FROM `libur_sekolah`
WHERE `status` = 'aktif'
AND `tanggal_mulai` <= '2026-05-22'
AND `tanggal_selesai` >= '2026-05-22'
 LIMIT 1
---
    public function cekTanggalLibur($tanggal)
    {
        return $this->where('status', 'aktif')
            ->where('tanggal_mulai <=', $tanggal)
            ->where('tanggal_selesai >=', $tanggal)
            ->first();