app/Models/SeBookEbookModel.php

    public function getLatestEbooks($limit = 4)
    {
        return $this->where('is_active', 1)
            ->orderBy('created_at', 'DESC')
            ->limit($limit)
            ->findAll();
---
SELECT *
FROM `sebook_ebook`
WHERE `is_active` = 1
ORDER BY `created_at` DESC
 LIMIT 4