app/Models/SpayPembayaranModel.php

SELECT `t`.*, COALESCE((SELECT SUM(nominal_bayar) FROM spay_pembayaran WHERE tagihan_id = t.id AND status = 'verified'), 0) as total_terbayar, (t.nominal - COALESCE((SELECT SUM(nominal_bayar) FROM spay_pembayaran WHERE tagihan_id = t.id AND status = 'verified'), 0)) as sisa_tagihan, (SELECT COUNT(*) FROM spay_pembayaran WHERE tagihan_id = t.id AND status = 'pending') as pending_count, (SELECT status FROM spay_pembayaran WHERE tagihan_id = t.id ORDER BY id DESC LIMIT 1) as last_status, (SELECT bukti_bayar FROM spay_pembayaran WHERE tagihan_id = t.id ORDER BY id DESC LIMIT 1) as last_bukti
FROM `spay_tagihan` `t`
WHERE `t`.`orang_tua_id` = '5'
ORDER BY `t`.`batas_bayar` ASC
---
    public function getTagihanByOrangTua($orangTuaId, $status = null)
    {
        $builder = $this->db->table('spay_tagihan t')
            ->select('t.*, p.status, p.bukti_bayar, p.id as pembayaran_id, p.created_at as bayar_created_at')
            ->join('spay_pembayaran p', 'p.tagihan_id = t.id AND p.orang_tua_id = t.orang_tua_id', 'left')
            ->where('t.orang_tua_id', $orangTuaId);
        if ($status) $builder->where('p.status', $status);
        return $builder->orderBy('t.batas_bayar', 'ASC')->get()->getResultArray();

SELECT `t`.*, `p`.`status`, `p`.`bukti_bayar`, `p`.`catatan_admin`, `p`.`id` as `pembayaran_id`, `p`.`tanggal_bayar`, `p`.`verified_at`
FROM `spay_tagihan` `t`
LEFT JOIN `spay_pembayaran` `p` ON `p`.`tagihan_id` = `t`.`id`
WHERE `t`.`id` = '18'
AND `t`.`orang_tua_id` = '6'
---
    public function getDetailTagihan($tagihanId, $orangTuaId)
    {
        return $this->db->table('spay_tagihan t')
            ->select('t.*, p.status, p.bukti_bayar, p.catatan_admin, p.id as pembayaran_id, p.tanggal_bayar, p.verified_at')
            ->join('spay_pembayaran p', 'p.tagihan_id = t.id', 'left')
            ->where('t.id', $tagihanId)
            ->where('t.orang_tua_id', $orangTuaId)
            ->get()->getRowArray();