app/Models/SpayPembayaranModel.php

    public function getStatsByOrangTua($orangTuaId)
    {
        $tagihan = $this->db->table('spay_tagihan')
            ->where('orang_tua_id', $orangTuaId)
            ->get()->getResultArray();
---
SELECT *
FROM `spay_tagihan`
WHERE `orang_tua_id` = '5'