app/Models/UserModel.php

SELECT `users`.*, `role`.`nama_role`
FROM `users`
LEFT JOIN `role` ON `role`.`id_role` = `users`.`id_role`
WHERE   (
`users`.`username` = 'testguru'
OR `users`.`email` = 'testguru'
 )
 LIMIT 1
---
    public function findForLogin(string $identifier): ?array
    {
        return $this->select('users.*, role.nama_role')
            ->join('role', 'role.id_role = users.id_role', 'left')
            ->groupStart()
                ->where('users.username', $identifier)
                ->orWhere('users.email', $identifier)
            ->groupEnd()
            ->first();